# RoofArea_TotalProj

## Description
Returns the total area projected on the ground plane of roofs or roof faces that meet the criteria.

```pascal
FUNCTION RoofArea_TotalProj(c : CRITERIA): REAL;
```

```python
def vs.RoofArea_TotalProj(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|   |

## Remarks
[[User:CBM-c-|_c_]] (2016.06.28): See remark on [[VS:RoofArea Heated]].

## See Also
* RoofArea Heated
* RoofArea HeatedProj
* RoofArea Total

## Version
Availability: from Vectorworks 14.0

## Category
* Criteria